#+title: One Eight

** Example
\[
T_{A}(k_{1}u_{1}+k_{2}u_{2} + ...) = k_{1}T_{A}(u_{1}) + k_{2}T_{A}(u_{2}) + ...
\]

The linear combination of the images of each vector under the transformation

when doing linear transformation it must be in a row

1. Define $T: \mathbb{R}^{2} \rightarrow{} \mathbb{R}^{3}$ by T(x,y) = (x,3x,2x+y)
   - $e_{1} = \begin{bmatrix}1\\0\end{bmatrix}$
   - $e_{2} = \begin{bmatrix}0\\1\end{bmatrix}$
   - T(e_{1}) = T(1,0) = (1,3,2)
   - T(e_{2}) = T(0,1) = (0,0,1)
   - So A, = $\begin{bmatrix}T(e_{1})&T(e_{2})\end{bmatrix} = \begin{bmatrix}1&0\\3&0\\2&1\end{bmatrix}$

2. Given that $T: \mathbb{R}^{3} \rightarrow{} \mathbb{R}^{3}$ is a linear transformation such that T(1,0,0) = (3,2,5), T(0,1,0) = (1,4,7) and T(0,0,1) = (2,0,6). Find T(10,25,21)
   - Method 1: $\begin{bmatrix}T(e_{1})&T(e_{2})&T(e_{3})\end{bmatrix} = \begin{bmatrix}3&1&2\\2&4&0\\5&7&6\end{bmatrix} \Rightarrow{} T(10,25,21) = A\begin{bmatrix}10\\25\\21\end{bmatrix}$
     - find the image of T(10,25,21) so after we find A we just attach A to the vector and do a matrix multiplication
     - $\begin{bmatrix}3&1&2\\2&4&0\\5&7&6\end{bmatrix}\begin{bmatrix}10\\25\\21\end{bmatrix}=\begin{bmatrix}97\\120\\351\end{bmatrix}$
   - Method 2: $\begin{bmatrix}10\\25\\21\end{bmatrix} = 10\begin{bmatrix}1\\0\\0\end{bmatrix} + 25\begin{bmatrix}0\\1\\0\end{bmatrix} + 21\begin{bmatrix}0\\0\\1\end{bmatrix} = 10e_{1} + 25e_{2} + 21e_{3}$
     - So T(10,25,21) = 10T(e_{1})+25T(e_{2})+21T(e_{3}) = same as above
3. Create the standard matrix that represents each transformation
   - $\begin{bmatrix}0&0\\0&1\end{bmatrix}\begin{bmatrix}x\\y\end{bmatrix} = \begin{bmatrix}0\\y\end{bmatrix}$

   - Rotate a vector(x,y) clockwise (-45$\degree{}$)
     - $\begin{bmatrix}cos45&sin45\\-sin45&cos45\end{bmatrix} = \begin{bmatrix}
     - $\begin{bmatrix}\frac{\sqrt{2}}{2}&\frac{\sqrt{2}}{2}\\\frac{-\sqrt{2}}{2}&\frac{\sqrt{2}}{2}\end{bmatrix}$
   - Project a vector(x,y,z) onto the z-axis
     - $\begin{bmatrix}0&0&0\\0&0&0\\0&0&1\end{bmatrix}$
     - $\begin{bmatrix}0&0&0\\0&0&0\\0&0&1\end{bmatrix}\begin{bmatrix}x\\y\\z\end{bmatrix} = \begin{bmatrix}0\\0\\z\end{bmatrix}$
#+begin_src octave
[3,1,2;2,4,0;5,7,6] * [10;25;21]
#+end_src

#+RESULTS:
|  97 |
| 120 |
| 351 |
